S1Сtest/src/Tasks/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>Задача</name>
  <addressing>InformationRegister.РегистрАдресации</addressing>
  <attributes>
    <name>ВидЭтапа</name>
    <type>
      <types>EnumRef.ВидыЭтаповПредоставленияГосУслуги</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Ведомство</name>
    <type>
      <types>CatalogRef.Ведомства</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

S1Сtest/src/Enums/ВидыРезультатаПредоставленияГосУслуги/ВидыРезультатаПредоставленияГосУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРезультатаПредоставленияГосУслуги</name>
  <enumValues>
    <name>Разрешение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
</mdclass:Enum>

S1Сtest/src/Documents/РезультатПредоставленияГосУслуги/РезультатПредоставленияГосУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатПредоставленияГосУслуги</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВидРезультата</name>
    <type>
      <types>EnumRef.ВидыРезультатаПредоставленияГосУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосУслуга</name>
    <type>
      <types>CatalogRef.ГосУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

S1Сtest/src/Tasks/Задача/ObjectModule.bsl
Процедура ПередВыполнением(Отказ)
	
	//Если ВидЭтапа = Перечисления.ВидыЭтаповПредоставленияГосУслуги.ВыдачаРешения Тогда
		
		// Формируем результат предоставления госуслуги
		
		УстановитьПривилегированныйРежим(Истина);
		
		РезультатОбъект = Документы.РезультатПредоставленияГосУслуги.СоздатьДокумент();
		РезультатОбъект.Дата = ТекущаяДата();
		РезультатОбъект.ВидРезультата = Перечисления.ВидыРезультатаПредоставленияГосУслуги.Разрешение;
		РезультатОбъект.ГосУслуга = БизнесПроцесс.ГосУслуга;
		РезультатОбъект.Получатель = БизнесПроцесс.Получатель;
		РезультатОбъект.Записать();
		
		БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
		БизнесПроцессОбъект.РезультатПредоставленияГосУслуги = РезультатОбъект.Ссылка;
		БизнесПроцессОбъект.Записать();
		
		УстановитьПривилегированныйРежим(Ложь);
		
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// Устанавливаем исполнителя
	
	Исполнитель = Справочники.Пользователи.НайтиПоНаименованию("Исполнитель", Истина);
	
КонецПроцедуры
